class InMyHead < ActiveHash::Base
  self.data = [
    { id: 1, name: '--' },
    { id: 2, name: '責任の所在（自己責任/他人への文句/責任転嫁）' },
    { id: 3, name: '自分の身に生じる事柄（叱責/事故処分/退任）' },
    { id: 4, name: '周囲の反響（そしり/陰口/批判）' },
    { id: 5, name: '事故の内部での吸収（反省/後悔/言い訳/正当化）' },
    { id: 6, name: 'ごまかしの対応行動（自虐/忘却/看過/隠蔽）' },
    { id: 7, name: '対策（改革/文化の改変/失敗情報の伝達/教育/人事）' },
    { id: 8, name: '失敗の自覚（認めたくない/見ない/覚悟して認める/嫌々認める/否認）' },
    { id: 9, name: '原因推定（組織/経過の回想/シミュレーション/聞き伝え）' },
    { id: 10, name: '事業続行の方策（法的措置/計画修正/顧客）' },
    { id: 11, name: '周囲組織への影響（従業員/株主/銀行/取引先/資本）' },
    { id: 12, name: 'その他' }
  ]
end
